src/cf/InformationRegisters/СервисСверкиРасчетовДанныеСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СервисСверкиРасчетовДанныеСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СервисСверкиРасчетовВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСверки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СервисСверкиРасчетовДанныеСервиса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанные(ДокументыПоДанным, Организация, Контрагент, ИдентификаторСверки, ДокументСсылка = "") Экспорт 
	
	Если ДокументыПоДанным.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписейДанныеДокументовПоСверке = РегистрыСведений.СервисСверкиРасчетовДанныеСервиса.СоздатьНаборЗаписей();
	НаборЗаписейДанныеДокументовПоСверке.Отбор.Организация.Установить(Организация);
	НаборЗаписейДанныеДокументовПоСверке.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписейДанныеДокументовПоСверке.Отбор.ИдентификаторСверки.Установить(ИдентификаторСверки);
	
	МассивИдентификаторовПоКонтрагенту = Новый Массив;
	Для Каждого ТекущаяСтрокаДокументыПоДанным Из ДокументыПоДанным Цикл

		Если НЕ ЗначениеЗаполнено(ТекущаяСтрокаДокументыПоДанным.ИдентификаторДокумента) Тогда
			// Защита от некорректных данных.
			Продолжить;
		КонецЕсли;
		
		Если МассивИдентификаторовПоКонтрагенту.Найти(ТекущаяСтрокаДокументыПоДанным.ИдентификаторДокумента) <> Неопределено Тогда
			// Защита от дублей.
			Продолжить;
		КонецЕсли;
		МассивИдентификаторовПоКонтрагенту.Добавить(ТекущаяСтрокаДокументыПоДанным.ИдентификаторДокумента);
		
		Если ДокументСсылка = Неопределено Тогда
			
			ДокументСсылка = Документы[ТекущаяСтрокаДокументыПоДанным.ВидДокумента].ПолучитьСсылку(ТекущаяСтрокаДокументыПоДанным.ИдентификаторДокумента);
			Если НЕ ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Запись = НаборЗаписейДанныеДокументовПоСверке.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ТекущаяСтрокаДокументыПоДанным);
		Запись.ИдентификаторСверки = ИдентификаторСверки;
		Запись.Организация = Организация;
		Запись.Контрагент = Контрагент;
		
	КонецЦикла;
	
	НаборЗаписейДанныеДокументовПоСверке.Записать();
	
КонецПроцедуры

Процедура УдалитьДанныеДокументовПоПараметрам(МенеджерЗаписи)Экспорт
	
	УдалитьЗаписьПоИдентификатору(МенеджерЗаписи.ИдентификаторСверкиПоОрганизации, 
		МенеджерЗаписи.Организация, МенеджерЗаписи.Контрагент);
	УдалитьЗаписьПоИдентификатору(МенеджерЗаписи.ИдентификаторСверкиКонтрагенту, 
		МенеджерЗаписи.Организация, МенеджерЗаписи.Контрагент);
	
КонецПроцедуры	

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьЗаписьПоИдентификатору(ИдентификаторСверки, Организация, Контрагент)
	
	Если Не ЗначениеЗаполнено(ИдентификаторСверки) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписейДанныеДокументовПоСверке = РегистрыСведений.СервисСверкиРасчетовДанныеСервиса.СоздатьНаборЗаписей();
	НаборЗаписейДанныеДокументовПоСверке.Отбор.ИдентификаторСверки.Установить(ИдентификаторСверки);
	НаборЗаписейДанныеДокументовПоСверке.Отбор.Организация.Установить(Организация);
	НаборЗаписейДанныеДокументовПоСверке.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписейДанныеДокументовПоСверке.Прочитать();
	НаборЗаписейДанныеДокументовПоСверке.Очистить();
	НаборЗаписейДанныеДокументовПоСверке.Записать();
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
